** Análise de Dados


#+BEGIN_SRC R :session *R* :async yes :results output silent
  options(crayon.enabled = FALSE)
  library(starvz)
  library(tidyverse)
  library(ggplot2)
  library(dplyr)

  base_dir = "./experimental-results"

  machines <- tribble(
    ~Machine, ~Processor, ~Ghz, ~Threads, ~Cores,
    "poti1", "Intel(R) Core(TM) i7-14700KF", 3.4, 28, 20,
    "cei2", "2 x Intel(R) Xeon(R) Silver 4116", 2.1, 48, 24,
    "draco1", "2 x Intel(R) Xeon(R) E5-2640 v2", 2.0, 32, 16
  )

  experiments <- read_csv('./ex-cpu-msamples.csv')

  all <- machines |> cross_join(experiments)

  msamples_table <- all |>
    mutate(FILE = paste0(base_dir,"/", Machine ,"/stdout-", WithIO, "-", Segmentation, "-", substring(1, Blocks), ".out")) |>
    mutate(BlockSize = 120 / Segmentation) |>
    mutate(Msamples = map_dbl(FILE, function(file) {
      #print(file)
      read_lines(file) |>
        tail(1) |>
        str_remove("Msamples/s: ") |>
        as.numeric()
    })) 
#+END_SRC

#+BEGIN_SRC R :session *R* :async yes

  base_dir <- "~/experiments/msamples-cpu-star-fletcher/comparison"
  exp_dir <- paste0(base_dir, "/experimental-results")

  machines <- tribble(
    ~Machine, ~Processor, ~Ghz, ~Threads, ~Cores,
    "poti4", "Intel(R) Core(TM) i7-14700KF", 3.4, 28, 20,
    "cei2", "2 x Intel(R) Xeon(R) Silver 4116", 2.1, 48, 24,
    "draco1", "2 x Intel(R) Xeon(R) E5-2640 v2", 2.0, 32, 16
  )

  experiments <- read_csv(paste0(base_dir, '/ex-cpu-msamples-base.csv'))

  all <- machines |> cross_join(experiments)
  print(all)

  msamples_base_table <- all |>
    mutate(FILE = paste0(exp_dir,"/", Machine ,"/stdout-", replication, ".out")) |>
    mutate(Msamples = map_dbl(FILE, function(file) {
      #print(file)
      res <- read_lines(file) |>
        str_subset("MSamples/s") |> 
        str_extract("[\\d.]+") |> 
        as.numeric()
      res[1]
    })) |>
    group_by(across(-c(replication, Msamples, FILE))) |>
    summarize(Mean = mean(Msamples), Min = min(Msamples), Max = max(Msamples)) |> print()
  
#+END_SRC

#+RESULTS:
| cei2   | 2 x Intel(R) Xeon(R) Silver 4116 | 2.1 | 48 | 24 |    25.0260775 | 24.607806 | 26.381761 |
| draco1 | 2 x Intel(R) Xeon(R) E5-2640 v2  |   2 | 32 | 16 | 18.0270485625 | 17.471431 | 18.693312 |
| poti4  | Intel(R) Core(TM) i7-14700KF     | 3.4 | 28 | 20 |  7.0756695625 |  7.034336 |  7.159821 |

